flag = -1

if flag < 0:
    print("참입니다!")
elif flag > 0:
    print("무엇인가요?") #무엇인가요?
else:
    print("거짓입니다!") 


print(flag, "은(는) 홀수입니다. " if flag % 2 != 0 else "은(는) 짝수입니다.")
#1 은(는) 홀수입니다.
print("=" * 30)
while flag > 0:
    print(flag)
    flag -= 1
else: #조건식이 false일 경우에 실행된다
    print("end")

str ="Python"
for s in str: #반복가능한 객체인 str에서 하나씩 꺼내 s에 담는 것을 반복한다
    print(s)
"""
P
y
t
h
o
n
"""
print("=" * 30)
for i in range(10): #10은 포함되지 않는다. 10은 마지막 번호
    print(i)
"""
0
1
2
3
4
5
6
7
8
9
"""
print("=" * 30)
for i in range(5, 10, 2): #시작번호, 끝번호(끝번호는 포함이 안됨), 건너뛸 번호
    print(i)
"""
5
7
9
"""
#구구단 만들기(2 ~ 9단)
print("=" * 30)
for i in range(2, 10):
    for j in range(1, 10):
        print(i, " * ", j, " = ", i * j)
"""
2  *  1  =  2
2  *  2  =  4
2  *  3  =  6
2  *  4  =  8
2  *  5  =  10
2  *  6  =  12
2  *  7  =  14
2  *  8  =  16
2  *  9  =  18
3  *  1  =  3
3  *  2  =  6
3  *  3  =  9
3  *  4  =  12
3  *  5  =  15
3  *  6  =  18
3  *  7  =  21
3  *  8  =  24
3  *  9  =  27
4  *  1  =  4
4  *  2  =  8
4  *  3  =  12
4  *  4  =  16
4  *  5  =  20
4  *  6  =  24
4  *  7  =  28
4  *  8  =  32
4  *  9  =  36
5  *  1  =  5
5  *  2  =  10
5  *  3  =  15
5  *  4  =  20
5  *  5  =  25
5  *  6  =  30
5  *  7  =  35
5  *  8  =  40
5  *  9  =  45
6  *  1  =  6
6  *  2  =  12
6  *  3  =  18
6  *  4  =  24
6  *  5  =  30
6  *  6  =  36
6  *  7  =  42
6  *  8  =  48
6  *  9  =  54
7  *  1  =  7
7  *  2  =  14
7  *  3  =  21
7  *  4  =  28
7  *  5  =  35
7  *  6  =  42
7  *  7  =  49
7  *  8  =  56
7  *  9  =  63
8  *  1  =  8
8  *  2  =  16
8  *  3  =  24
8  *  4  =  32
8  *  5  =  40
8  *  6  =  48
8  *  7  =  56
8  *  8  =  64
8  *  9  =  72
9  *  1  =  9
9  *  2  =  18
9  *  3  =  27
9  *  4  =  36
9  *  5  =  45
9  *  6  =  54
9  *  7  =  63
9  *  8  =  72
9  *  9  =  81
"""